note/auto-stock.org
#+TITLE: 中国股市行情分析笔记
* stock source
** 雪球接口

- 股票代码数据接口

  [[https://xueqiu.com/stock/quote_order.json?page=1&size=1000&order=desc&exchange=CN&stockType=sza&orderBy=percent&column=symbol,name][深圳A股代码获取接口]]
  
  [[https://xueqiu.com/stock/quote_order.json?page=1&size=1000&order=desc&exchange=CN&stockType=cyb&orderBy=percent&column=symbol,name][创业板代码获取接口]]
  
  [[https://xueqiu.com/stock/quote_order.json?page=1&size=1000&order=desc&exchange=CN&stockType=sha&orderBy=percent&column=symbol,name][上海A股代码获取接口]]
  
- [[https://stock.xueqiu.com/v5/stock/quote.json?symbol=SH603880&extend=detail][单只股票实时交易接口]]
 
  具体交易字段对应表如下

  | symbol               |          SZ000651 |              |
  | code                 |            000651 |              |
  | exchange             |                SZ |              |
  | name                 |          格力电器 |              |
  | type                 |                11 |              |
  | sub_type             |                 1 |              |
  | status               |                 1 |              |
  | current              |              40.6 | 当前价格     |
  | currency             |               CNY |              |
  | percent              |             -0.76 | 涨跌幅 %     |
  | chg                  |             -0.31 | 涨跌幅       |
  | timestamp            |     1535612643000 |              |
  | time                 |     1535612643000 |              |
  | lot_size             |               100 |              |
  | tick_size            |              0.01 |              |
  | open                 |             40.99 | 今开         |
  | last_close           |             40.91 | 昨收         |
  | high                 |             41.39 | 最高         |
  | low                  |              39.9 | 最低         |
  | avg_price            |            40.666 | 散户平均     |
  | volume               |          48278906 | 成交量       |
  | amount               |   1.96332474448E9 | 成交额       |
  | turnover_rate        |              0.81 | 换手         |
  | amplitude            |              3.64 | 振幅         |
  | market_capital       |                2. | 总市值       |
  | float_market_capital |  2.42374520343E11 | 流通值       |
  | total_shares         |        6015730878 | 总股本       |
  | float_shares         |        5969815772 | 流通股       |
  | issue_date           |      848246400000 |              |
  | lock_set             |              null |              |
  | high52w              |              58.7 | 52周最高     |
  | low52w               |             36.42 | 52周最低     |
  | limit_up             |              45.0 | ×            |
  | limit_down           |             36.82 | ×            |
  | volume_ratio         |              1.21 | 量比         |
  | eps                  |              4.28 | 每股收益     |
  | pe_ttm               |             9.483 | 市盈率       |
  | pe_forecast          |             9.536 | 市盈率（动） |
  | pe_lyr               |            10.903 | 市盈率（静） |
  | navps                |             11.79 | 每股净资产   |
  | pb                   |             3.444 | 市净率       |
  | dividend             |              null |              |
  | dividend_yield       |             4.636 | 委比  %      |
  | profit               | 2.240157620494E10 |              |
  | profit_four          | 2.575529336861E10 |              |
  | profit_forecast      |   2.5612400927E10 |              |
  |                      |                   |              |
  |                      |                   |              |
  |                      |                   |              |
