note/auto-stock.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-28 Sun 22:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>中国股市行情分析笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="manue1" />
<link rel="stylesheet" type="text/css" href="https://www.manue1.site/css/style.css" />
<link rel="shortcut icon" href="https://www.manue1.site/images/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/q&a.html">Q&A</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/read.html">Read</a> </li>
        <li class="search">
            <form action="https://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.site">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">中国股市行情分析笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org734743a">1. stock source</a>
<ul>
<li><a href="#org531a7be">1.1. 雪球接口</a></li>
<li><a href="#org19c7ec5">1.2. 东方财富网接口</a></li>
<li><a href="#org360a20e">1.3. 腾讯微证券</a>
<ul>
<li><a href="#org8878523">1.3.1. stock info</a>
<ul>
<li><a href="#org863228b">1.3.1.1. 1</a></li>
<li><a href="#orga05b18c">1.3.1.2. 2</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf40bc24">1.4. 深交所</a></li>
<li><a href="#org50ce057">1.5. 策略</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org734743a" class="outline-2">
<h2 id="org734743a"><span class="section-number-2">1</span> stock source</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org531a7be" class="outline-3">
<h3 id="org531a7be"><span class="section-number-3">1.1</span> 雪球接口</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><p>
股票代码数据接口
</p>

<p>
<a href="https://xueqiu.com/stock/quote_order.json?page=1&amp;size=1000&amp;order=desc&amp;exchange=CN&amp;stockType=sza&amp;orderBy=percent&amp;column=symbol,name">深圳A股代码获取接口</a>
</p>

<p>
<a href="https://xueqiu.com/stock/quote_order.json?page=1&amp;size=1000&amp;order=desc&amp;exchange=CN&amp;stockType=cyb&amp;orderBy=percent&amp;column=symbol,name">创业板代码获取接口</a>
</p>

<p>
<a href="https://xueqiu.com/stock/quote_order.json?page=1&amp;size=1000&amp;order=desc&amp;exchange=CN&amp;stockType=sha&amp;orderBy=percent&amp;column=symbol,name">上海A股代码获取接口</a>
</p></li>

<li><p>
<a href="https://stock.xueqiu.com/v5/stock/quote.json?symbol=SH603880&amp;extend=detail">单只股票实时交易接口</a>
</p>

<p>
具体交易字段对应表如下
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">symbol</td>
<td class="org-right">SZ000651</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">code</td>
<td class="org-right">000651</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exchange</td>
<td class="org-right">SZ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">name</td>
<td class="org-right">格力电器</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">type</td>
<td class="org-right">11</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sub<sub>type</sub></td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">status</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">current</td>
<td class="org-right">40.6</td>
<td class="org-left">当前价格</td>
</tr>

<tr>
<td class="org-left">currency</td>
<td class="org-right">CNY</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">percent</td>
<td class="org-right">-0.76</td>
<td class="org-left">涨跌幅 %</td>
</tr>

<tr>
<td class="org-left">chg</td>
<td class="org-right">-0.31</td>
<td class="org-left">涨跌幅</td>
</tr>

<tr>
<td class="org-left">timestamp</td>
<td class="org-right">1535612643000</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">time</td>
<td class="org-right">1535612643000</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lot<sub>size</sub></td>
<td class="org-right">100</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tick<sub>size</sub></td>
<td class="org-right">0.01</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">open</td>
<td class="org-right">40.99</td>
<td class="org-left">今开</td>
</tr>

<tr>
<td class="org-left">last<sub>close</sub></td>
<td class="org-right">40.91</td>
<td class="org-left">昨收</td>
</tr>

<tr>
<td class="org-left">high</td>
<td class="org-right">41.39</td>
<td class="org-left">最高</td>
</tr>

<tr>
<td class="org-left">low</td>
<td class="org-right">39.9</td>
<td class="org-left">最低</td>
</tr>

<tr>
<td class="org-left">avg<sub>price</sub></td>
<td class="org-right">40.666</td>
<td class="org-left">散户平均</td>
</tr>

<tr>
<td class="org-left">volume</td>
<td class="org-right">48278906</td>
<td class="org-left">成交量</td>
</tr>

<tr>
<td class="org-left">amount</td>
<td class="org-right">1.96332474448E9</td>
<td class="org-left">成交额</td>
</tr>

<tr>
<td class="org-left">turnover<sub>rate</sub></td>
<td class="org-right">0.81</td>
<td class="org-left">换手</td>
</tr>

<tr>
<td class="org-left">amplitude</td>
<td class="org-right">3.64</td>
<td class="org-left">振幅</td>
</tr>

<tr>
<td class="org-left">market<sub>capital</sub></td>
<td class="org-right">2.</td>
<td class="org-left">总市值</td>
</tr>

<tr>
<td class="org-left">float<sub>market</sub><sub>capital</sub></td>
<td class="org-right">2.42374520343E11</td>
<td class="org-left">流通值</td>
</tr>

<tr>
<td class="org-left">total<sub>shares</sub></td>
<td class="org-right">6015730878</td>
<td class="org-left">总股本</td>
</tr>

<tr>
<td class="org-left">float<sub>shares</sub></td>
<td class="org-right">5969815772</td>
<td class="org-left">流通股</td>
</tr>

<tr>
<td class="org-left">issue<sub>date</sub></td>
<td class="org-right">848246400000</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lock<sub>set</sub></td>
<td class="org-right">null</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">high52w</td>
<td class="org-right">58.7</td>
<td class="org-left">52周最高</td>
</tr>

<tr>
<td class="org-left">low52w</td>
<td class="org-right">36.42</td>
<td class="org-left">52周最低</td>
</tr>

<tr>
<td class="org-left">limit<sub>up</sub></td>
<td class="org-right">45.0</td>
<td class="org-left">×</td>
</tr>

<tr>
<td class="org-left">limit<sub>down</sub></td>
<td class="org-right">36.82</td>
<td class="org-left">×</td>
</tr>

<tr>
<td class="org-left">volume<sub>ratio</sub></td>
<td class="org-right">1.21</td>
<td class="org-left">量比</td>
</tr>

<tr>
<td class="org-left">eps</td>
<td class="org-right">4.28</td>
<td class="org-left">每股收益</td>
</tr>

<tr>
<td class="org-left">pe<sub>ttm</sub></td>
<td class="org-right">9.483</td>
<td class="org-left">市盈率</td>
</tr>

<tr>
<td class="org-left">pe<sub>forecast</sub></td>
<td class="org-right">9.536</td>
<td class="org-left">市盈率（动）</td>
</tr>

<tr>
<td class="org-left">pe<sub>lyr</sub></td>
<td class="org-right">10.903</td>
<td class="org-left">市盈率（静）</td>
</tr>

<tr>
<td class="org-left">navps</td>
<td class="org-right">11.79</td>
<td class="org-left">每股净资产</td>
</tr>

<tr>
<td class="org-left">pb</td>
<td class="org-right">3.444</td>
<td class="org-left">市净率</td>
</tr>

<tr>
<td class="org-left">dividend</td>
<td class="org-right">null</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dividend<sub>yield</sub></td>
<td class="org-right">4.636</td>
<td class="org-left">委比  %</td>
</tr>

<tr>
<td class="org-left">profit</td>
<td class="org-right">2.240157620494E10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">profit<sub>four</sub></td>
<td class="org-right">2.575529336861E10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">profit<sub>forecast</sub></td>
<td class="org-right">2.5612400927E10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
