note/auto-stock.html
<div id="outline-container-org19c7ec5" class="outline-3">
<h3 id="org19c7ec5"><span class="section-number-3">1.2</span> 东方财富网接口</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="http://nufm.dfcfw.com/EM_Finance2014NumericApplication/JS.aspx?type=CT&amp;cmd=3001012&amp;sty=CTBF&amp;st=z&amp;sr=&amp;p=&amp;ps=&amp;cb=var%20pie_data=&amp;js=(x)&amp;token=28758b27a75f62dc3065b81f7facb365&amp;_=1497258906443">获取主力买入排行的接口</a>
</p>

<p>
获取主力偏好的股票代码，减少股票过滤样本
</p>

<ol class="org-ol">
<li><p>
主力资金流向
</p>

<p>
<a href="http://data.eastmoney.com/zjlx/list.html">http://data.eastmoney.com/zjlx/list.html</a>
</p>

<p>
<a href="http://data.eastmoney.com/zjlx/detail.html">http://data.eastmoney.com/zjlx/detail.html</a>
</p>

<p>
<a href="http://nufm.dfcfw.com/EM_Finance2014NumericApplication/JS.aspx?type=ct&amp;st=(BalFlowNetRate)">http://nufm.dfcfw.com/EM_Finance2014NumericApplication/JS.aspx?type=ct&amp;st=(BalFlowNetRate)</a>&amp;sr=-1&amp;p=1&amp;ps=50&amp;js=var FcQDTvYs={pages:(pc),date:%222014-10-22%22,data:[(x)]}&amp;token=894050c76af8597a853f5b408b759f5d&amp;cmd=C.<sub>AB</sub>&amp;sty=DCFFITA&amp;rt=51124918
</p></li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">0</th>
<th scope="col" class="org-left">股票类型 无用</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">股票id</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">股票名称</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">最新价格</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">今日涨跌幅</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">今日主力净流入资金</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">今日主力净流入占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">今日超大单净流 资金</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">今日大单净流入</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">今日中单净流入</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">今日小单净流入</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">日期</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">weizhi</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ol class="org-ol">
<li><p>
单只股票主力 30 日主力 大单小单占比
<a href="http://ff.eastmoney.com/EM_CapitalFlowInterface/api/js?type=hff&amp;rtntype=2&amp;acces_token=1942f5da9b46b069953c873404aad4b5&amp;js">http://ff.eastmoney.com/EM_CapitalFlowInterface/api/js?type=hff&amp;rtntype=2&amp;acces_token=1942f5da9b46b069953c873404aad4b5&amp;js</a>=({data:[(x)]})&amp;cb=var%20zlzjLsData=&amp;check=TMLBMSPROCR&amp;id=3003102&amp;style=top&amp;num=31
</p>

<p>
2018-08-13,3068.4965,32.3%,1705.6208,17.95%,1362.8757,14.34%,-1093.2954,-11.51%,-1975.201,-20.79%,5.28,10.0%
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">0</th>
<th scope="col" class="org-left">日期</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">今日 主力资金</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">今日 主力占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">今日 超大单资金</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">今日占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">今日大单资金</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">今日占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">今日中单</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">占比</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">今日小单</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">占比</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>
<li><p>
单股 k线 信息
<a href="http://pdfm2.eastmoney.com/EM_UBG_PDTI_Fast/api/js?id=3003102&amp;TYPE=K&amp;js=fsData">http://pdfm2.eastmoney.com/EM_UBG_PDTI_Fast/api/js?id=3003102&amp;TYPE=K&amp;js=fsData</a>((x))&amp;rtntype=5&amp;style=top&amp;num=120&amp;authorityType=fa
</p>

<p>
2018-08-13,4.72,5.28,5.28,4.69,187158,95905294,12.29%,2.98"
</p></li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">0</th>
<th scope="col" class="org-left">日期</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">开盘</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">收盘</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-left">最高</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">最低</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">成交量</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">成交额</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">振幅</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">换手</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ol class="org-ol">
<li>前三热门板块
<a href="http://data.eastmoney.com/bkzj/hy.html">http://data.eastmoney.com/bkzj/hy.html</a></li>
<li>单只股票所属板块跌幅</li>
<li>筹码分布</li>
</ol>

<p>
<a href="http://quote.eastmoney.com/concept/sz002331.html">http://quote.eastmoney.com/concept/sz002331.html</a>#
</p>
</div>
</div>
