note/auto-stock.org
**** 1
    POST请求

    https://wzq.tenpay.com/cgi-bin/stockinfo.fcgi?_=1553089507107
    

    form 
    
    #+BEGIN_SRC python
    form = {
        "scode": "300337",
        "markets": "0",
        "needfive": "1",
        "needquote": "1",
        "needfollow": "1"
    }

    #+END_SRC

    #+BEGIN_SRC python
    {
        "retcode": "0",
        "retmsg": "OK",
        "has_follow": "1",
        "market_state": "6",
        "servertime": "1553089506",
        "five_trans": {
            "code": "300741",
            "market": "0",
            "mcbl": "0.50",
            "mcjg1": "41.61",
            "mcjg2": "41.62",
            "mcjg3": "41.63",
            "mcjg4": "41.64",
            "mcjg5": "41.65",
            "mcsl1": "2",
            "mcsl2": "75",
            "mcsl3": "33",
            "mcsl4": "159",
            "mcsl5": "239",
            "mrbl": "0.50",
            "mrjg1": "41.60",
            "mrjg2": "41.59",
            "mrjg3": "41.58",
            "mrjg4": "41.57",
            "mrjg5": "41.56",
            "mrsl1": "116",
            "mrsl2": "86",
            "mrsl3": "42",
            "mrsl4": "5",
            "mrsl5": "60"
        },
        "secu_info": {
            "market": "0",
            "price_ceiling": "46.19",
            "price_floor": "37.79",
            "secu_cls": "4",
            "secu_code": "300741",
            "secu_name": "华宝股份",
            "spread": "0.01",
            "status": "0",
            "stk_name": "华宝股份",
            "susp_flag": "0",
            "symbol": "sz300741",
            "trd_ceiling": "99999999",
            "trd_floor": "1",
            "trd_unit": "100"
        },
        "secu_quote": {
            "amplitude": "3.81",
            "avg_price": "41.45",
            "cje": "197120000",
            "cjj_price": "",
            "cjl": "4755200",
            "code": "300741",
            "dqj": "41.60",
            "fall_num": "-",
            "gxl": "",
            "hold_num": "-",
            "hsl": "7.72",
            "jj_jz": "-",
            "jkj": "42.01",
            "lsacle": "0.58",
            "ltz": "25.62",
            "lyr_ratio": "21.79",
            "market": "0",
            "mgsy": "",
            "npl": "27264",
            "pbratio": "2.85",
            "raise_num": "-",
            "sjl": "2.85",
            "syl": "21.79",
            "ttm_ratio": "21.79",
            "utime": "1553067004",
            "wccale": "-199",
            "week52zdj": "",
            "week52zgj": "",
            "weekratio": "",
            "wpl": "20225",
            "zde": "-0.39",
            "zdf": "-0.93",
            "zdj": "40.68",
            "zf": "3.81",
            "zgj": "42.28",
            "zsj": "41.99",
            "zsz": "256.21"
        }
    }
    #+END_SRC






- five_trans

 最近五个交易价格

| 字段   |   内容 | 描述    |
|--------+--------+---------|
| code   | 300741 |         |
| market |      0 |         |
| mcbl   |   0.50 |         |
| mcjg1  |  41.61 | 卖1     |
| mcjg2  |  41.62 |         |
| mcjg3  |  41.63 |         |
| mcjg4  |  41.64 |         |
| mcjg5  |  41.65 |         |
| mcsl1  |      2 | 卖1挂单 |
| mcsl2  |     75 |         |
| mcsl3  |     33 |         |
| mcsl4  |    159 |         |
| mcsl5  |    239 |         |
| mrbl   |   0.50 |         |
| mrjg1  |  41.60 | 买1     |
| mrjg2  |  41.59 |         |
| mrjg3  |  41.58 |         |
| mrjg4  |  41.57 |         |
| mrjg5  |  41.56 |         |
| mrsl1  |    116 | 买1挂单 |
| mrsl2  |     86 |         |
| mrsl3  |     42 |         |
| mrsl4  |      5 |         |
| mrsl5  |     60 |         |

secu_info
| 字段          |     内容 | 描述 |
|---------------+----------+------|
| market        |        0 |      |
| price_ceiling |    46.19 |      |
| price_floor   |    37.79 |      |
| secu_cls      |        4 |      |
| secu_code     |   300741 |      |
| secu_name     | 华宝股份 |      |
| spread        |     0.01 |      |
| status        |        0 |      |
| stk_name      | 华宝股份 |      |
| susp_flag     |        0 |      |
| symbol        | sz300741 |      |
| trd_ceiling   | 99999999 |      |
| trd_floor     |        1 |      |
| trd_unit      |      100 |      |

secu_quote
| 字段      |       内容 | 描述       |
|-----------+------------+------------|
| amplitude |       3.81 |            |
| avg_price |      41.45 |            |
| cje       |  197120000 | 成交额     |
| cjj_price |            |            |
| cjl       |    4755200 | 成交量     |
| code      |     300741 |            |
| dqj       |      41.60 | 当前价格   |
| fall_num  |          - |            |
| gxl       |            |            |
| hold_num  |          - |            |
| hsl       |       7.72 | 换手率     |
| jj_jz     |          - |            |
| jkj       |      42.01 |            |
| lsacle    |       0.58 | 量比       |
| ltz       |      25.62 | 流通值  亿 |
| lyr_ratio |      21.79 |            |
| market    |          0 |            |
| mgsy      |            |            |
| npl       |      27264 | 内盘2.73万 |
| pbratio   |       2.85 |            |
| raise_num |          - |            |
| sjl       |       2.85 | 市净率     |
| syl       |      21.79 | 市盈率     |
| ttm_ratio |      21.79 |            |
| utime     | 1553067004 | 当前时间   |
| wccale    |       -199 |            |
| week52zdj |            |            |
| week52zgj |            |            |
| weekratio |            |            |
| wpl       |      20225 |            |
| zde       |      -0.39 |            |
| zdf       |      -0.93 |            |
| zdj       |      40.68 |            |
| zf        |       3.81 | 振幅 %     |
| zgj       |      42.28 |            |
| zsj       |      41.99 |            |
| zsz       |     256.21 | 总市值     |

