note/auto-stock.org
**** 2
     
     https://wzq.tenpay.com/cgi-bin/stockinfo.fcgi?_=1553093241896

     #+BEGIN_SRC python
     type                    12 
     scode                   300741
     markets                 0
     #+END_SRC

     #+BEGIN_SRC python


     #+END_SRC

"data": -> quotations

"avg_deal_price": 41.45,
"date": "2019-03-20",
"ma10": -11782393.3,
"ma20": -7211902.05,
"ma5": -20423293.2,
"main_inflow": -12338301.0,
"net_capital_inflow": -28532798.0,
"plate_net_capital_inflow": -1973596.551493,
"price": 41.6,
"retail_inflow": -16194497.0,
"turnover_money": 197120000.0
     
** 深交所

   股票列表
   http://www.szse.cn/api/report/ShowReport?SHOWTYPE=xlsx&CATALOGID=1110&TABKEY=tab1&random=0.1086889598609524
   
   股权登记日信息爬取
   
   http://irm.cninfo.com.cn/ssessgs/S000418/index.html
   
   ~//table[@style="background:#A2D7FD; width:190px; margin:5px auto;"]/tbody/tr~
** 策略

实时数据获取

- 换手率
  七、换手率法选股注意事项

  1、每日收盘后对换手率进行排行，观察换手率在6%以上的个股。
  
  2、选择流通股本数量较小的，最好在3亿以下，中小板尤佳。
  
  4、第二日开盘阶段量比较大排在量比排行榜前列的个股。

  
  只要围绕当前热点股、强势股来做，其收益会比做大盘股收益更佳。

  1. 流通量
     一是做为价值投资者从事长期投资，那么就要选择市盈率低，业绩增长稳定的大盘股来做；
     二如果是单纯只想做中短线的投资者，笔者建议只做一些流通股本少的，市场上热点不断的中小盘股
