note/auto-stock.html

<div id="outline-container-orga05b18c" class="outline-5">
<h5 id="orga05b18c"><span class="section-number-5">1.3.1.2</span> 2</h5>
<div class="outline-text-5" id="text-1-3-1-2">
<p>
<a href="https://wzq.tenpay.com/cgi-bin/stockinfo.fcgi?_=1553093241896">https://wzq.tenpay.com/cgi-bin/stockinfo.fcgi?_=1553093241896</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #af3a03;">type</span>                    12 
scode                   300741
markets                 0
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">

</pre>
</div>

<p>
"data": -&gt; quotations
</p>

<p>
"avg<sub>deal</sub><sub>price</sub>": 41.45,
"date": "2019-03-20",
"ma10": -11782393.3,
"ma20": -7211902.05,
"ma5": -20423293.2,
"main<sub>inflow</sub>": -12338301.0,
"net<sub>capital</sub><sub>inflow</sub>": -28532798.0,
"plate<sub>net</sub><sub>capital</sub><sub>inflow</sub>": -1973596.551493,
"price": 41.6,
"retail<sub>inflow</sub>": -16194497.0,
"turnover<sub>money</sub>": 197120000.0
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf40bc24" class="outline-3">
<h3 id="orgf40bc24"><span class="section-number-3">1.4</span> 深交所</h3>
<div class="outline-text-3" id="text-1-4">
<p>
股票列表
<a href="http://www.szse.cn/api/report/ShowReport?SHOWTYPE=xlsx&amp;CATALOGID=1110&amp;TABKEY=tab1&amp;random=0.1086889598609524">http://www.szse.cn/api/report/ShowReport?SHOWTYPE=xlsx&amp;CATALOGID=1110&amp;TABKEY=tab1&amp;random=0.1086889598609524</a>
</p>

<p>
股权登记日信息爬取
</p>

<p>
<a href="http://irm.cninfo.com.cn/ssessgs/S000418/index.html">http://irm.cninfo.com.cn/ssessgs/S000418/index.html</a>
</p>

<p>
<code>//table[@style="background:#A2D7FD; width:190px; margin:5px auto;"]/tbody/tr</code>
</p>
</div>
</div>
<div id="outline-container-org50ce057" class="outline-3">
<h3 id="org50ce057"><span class="section-number-3">1.5</span> 策略</h3>
<div class="outline-text-3" id="text-1-5">
<p>
实时数据获取
</p>

<ul class="org-ul">
<li><p>
换手率
七、换手率法选股注意事项
</p>

<p>
1、每日收盘后对换手率进行排行，观察换手率在6%以上的个股。
</p>

<p>
2、选择流通股本数量较小的，最好在3亿以下，中小板尤佳。
</p>

<p>
4、第二日开盘阶段量比较大排在量比排行榜前列的个股。
</p></li>
</ul>


<p>
只要围绕当前热点股、强势股来做，其收益会比做大盘股收益更佳。
</p>

<ol class="org-ol">
<li>流通量
一是做为价值投资者从事长期投资，那么就要选择市盈率低，业绩增长稳定的大盘股来做；
二如果是单纯只想做中短线的投资者，笔者建议只做一些流通股本少的，市场上热点不断的中小盘股</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> © 2006-2019 powered by
    <a href="https://www.gnu.org/software/emacs/">emacs</a> 
    <a href="http://orgmode.org/">org-mode</a>
</p>
<script src="https://www.manue1.site/css/jquery-2.1.3.min.js"></script>
<script src="https://www.manue1.site/css/main.js"></script>
</div>
</body>
</html>